Revit 2027 API
BuiltInFailures.RoofFailures.CurveRoofSkippedLoopsError Property
 Some loops were skipped
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurveRoofSkippedLoopsError { get; }
Public Shared ReadOnly Property CurveRoofSkippedLoopsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurveRoofSkippedLoopsError {
	FailureDefinitionId^ get ();
}
static member CurveRoofSkippedLoopsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace